INSERT INTO quiz(name,photo)
VALUES('Закончи подпись к мему','3_.jpg');

INSERT INTO question(text,answer,photo,quiz_id)
VALUES('____ - 4 буквы', 'гнег', '22.jpg', 3),
      ('Нельзя просто так _____ - 5 букв', 'взять', '23.jpg', 3),
      ('______ - 6 букв', 'Превед', '24.jpg', 3),
      ('_____ - 5 букв', 'ладно', '25.jpg', 3),
      ('____ - 4 буквы', 'вжух', '26.jpg', 3),
      ('хочу ______ - 6 букв', 'оливье', '27.jpg', 3),
      ('____ ____ ____ ____ __/__ ___ - 23 буквы', '...', '28.jpg', 3),
      ('Колобок _____ - 9 букв', 'повесился', '29.jpg', 3),
      ('ооо _______ - 7 букв', 'сыровое', '30.jpg', 3),
      ('___ - 3 буквы', 'тут', '31.jpg', 3),
      ('_ - 1 буква', 'а', '32.jpg', 3),
      ('______ - 6 букв', 'ничоси', '33.jpg', 3),
      ('_______ - 7 букв', 'чипсеки', '34.jpg', 3),
      ('_______ - 7 букв', 'дратути', '35.jpg', 3),
      ('мыш (_________) - 9 букв', 'кродеться', '36.jpg', 3),
      ('На площади Тяньаньмэнь ничего не _________ - 9 букв', 'произошло', '37.jpg', 3),
      ('Это _ - 1 буква', 'я', '38.jpg', 3),
      ('Кама-Пуля ____ - 4 буквы', 'ежжи', '39.jpg', 3),
      ('Оно тебя ______! - 6 букв', 'сожрет', '40.jpg', 3),
      ('Ну ты _____ - 5 букв', 'видел', '41.jpg', 3);